Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/CAN_STM32F4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2018 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        6. November 2018
 * $Revision:    V1.16
 *
 * Driver:       Driver_CAN1/2/3
 * Configured:   via RTE_Device.h configuration file
 * Project:      CAN Driver for ST STM32F4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   CAN Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_CAN# = 1       use CAN1
 *   Connect to hardware via Driver_CAN# = 2       use CAN2
 *   Connect to hardware via Driver_CAN# = 3       use CAN3
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *
 *   CAN_CLOCK_TOLERANCE:  defines maximum allowed clock tolerance in 1/1024 steps
 *     - default value:    15 (approx. 1.5 %)
 *   CAN1_FILTER_BANK_NUM: defines maximum number of Filter Banks used for CAN1 controller (0..28)
 *                         (sum of maximum number of Filter Banks used for CAN1 and CAN2 must not exceed 28)
 *     - default value:    14
 *   CAN2_FILTER_BANK_NUM: defines maximum number of Filter Banks used for CAN2 controller (0..28)
 *                         (sum of maximum number of Filter Banks used for CAN1 and CAN2 must not exceed 28)
 *     - default value:    14
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.16
 *    Corrected SetBitrate function to leave Silent and Loopback mode as they were
 *    Corrected SetMode function to clear Silent and Loopback mode when NORMAL mode is activated
 *  Version 1.15
 *    Corrected MessageSend function to only access required data for sending
 *  Version 1.14
 *    Corrected abort message send functionality (IRQ deadloop)
 *  Version 1.13
 *    Added support for ARM Compiler 6
 *  Version 1.12
 *    Corrected SetBitrate function
 *  Version 1.11
 *    Corrected comment and code for CubeMX CAN interrupts settings
 *    (should be disabled)
 *  Version 1.10
 *    Corrected filter setting for adding/removing maskable Standard ID
 *  Version 1.9
 *    Added CAN3
 *  Version 1.8
 *    Corrected clearing of overrun flag in interrupt routine
 *  Version 1.7
 *    Added port configuration for ports supported by new subfamily
 *  Version 1.6
 *    Corrected CAN2 initialization was disabling CAN1 filters
 *  Version 1.5
 *    Corrected receive overrun signaling
 *  Version 1.4
 *    Corrected functionality when NULL pointer is provided for one or both 
 *    signal callbacks in Initialize function call
 *  Version 1.3
 *    Corrected functionality when only one CAN controller is used
 *  Version 1.2
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *  Version 1.1
 *    Corrected option for selecting only CAN1
 *    Added clock enable before power off
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32f4_can CMSIS-Driver CAN Setup

The CMSIS-Driver CAN requires:
  - APB1 Clock (maximum frequency is 42 MHz)
  - Configuration of CAN
 
Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | MCBSTM32F400         | STM32F4-Discovery    | 32F401C-Discovery    | 32F429I-Discovery
:-------------------|:---------------------|:---------------------|:---------------------|:------------------
CAN1 Mode           | CAN1: <b>Master</b>  | CAN1: <b>Master</b>  | n/a                  | CAN1: <b>Master</b>
CAN1_RX pin         | PI9                  | PA11/PB8/PD0         | n/a                  | PA11/PB8/PD0
CAN1_TX pin         | PH13                 | PA12/PB9/PD1         | n/a                  | PA12/PB9/PD1
CAN2 Mode           | CAN2: <b>Slave</b>   | CAN2: <b>Slave</b>   | n/a                  | CAN2: <b>Slave</b>
CAN2_RX pin         | PB5                  | PB5/PB12             | n/a                  | PB5/PB12
CAN2_TX pin         | PB13                 | PB6/PB13             | n/a                  | PB6/PB13
CAN3 Mode           | CAN3: <b>Master</b>  | CAN3: <b>Master</b>  | n/a
CAN3_RX pin         | n/a                  | n/a                  | n/a
CAN3_TX pin         | n/a                  | n/a                  | n/a
 
For different boards, refer to the hardware schematics to reflect correct setup values.
 
The STM32CubeMX configuration for Keil MCBSTM32F400 Board with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.
 
Pinout tab
----------
  1. Configure CAN1 mode
     - Peripheral \b CAN1: Mode=<b>Master Mode</b>
  2. Configure CAN2 mode
     - Peripheral \b CAN2: Mode=<b>Slave Mode</b>
 
Clock Configuration tab
-----------------------
  1. Configure APB1 Clock (maximum frequency is 42 MHz)
     - Setup "APB1 peripheral clocks (MHz)" to match application requirements
 
Configuration tab
-----------------
  1. Under Connectivity open \b CAN1 Configuration:
     - Parameter Settings: not used
     - User Constants: not used
     - <b>NVIC Settings</b>: review settings, no changes required
          Interrupt Table          | Enable | Preemption Priority | Sub Priority
          :------------------------|:-------|:--------------------|:--------------
          CAN1 TX interrupts       |\b OFF  | 0                   | 0
          CAN1 RX0 interrupts      |\b OFF  | 0                   | 0
          CAN1 RX1 interrupts      |\b OFF  | 0                   | 0
          CAN1 SCE interrupts      |\b OFF  | 0                   | 0
     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin |  GPIO mode  | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:------------|:-------------------|:------------|:----------
          PI9      | CAN1_RX       | Alternate ..| No pull-up and no..| High        |.
          PH13     | CAN1_TX       | Alternate ..| No pull-up and no..| High        |.
     - Click \b OK to close the CAN1 Configuration dialog
  2. Under Connectivity open \b CAN2 Configuration:
     - Parameter Settings: not used
     - User Constants: not used
     - <b>NVIC Settings</b>: review settings, no changes required
          Interrupt Table          | Enable | Preemption Priority | Sub Priority
          :------------------------|:-------|:--------------------|:--------------
          CAN2 TX interrupts       |\b OFF  | 0                   | 0
          CAN2 RX0 interrupts      |\b OFF  | 0                   | 0
          CAN2 RX1 interrupts      |\b OFF  | 0                   | 0
          CAN2 SCE interrupts      |\b OFF  | 0                   | 0
     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin |  GPIO mode  | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:------------|:-------------------|:------------|:----------
          PB5      | CAN2_RX       | Alternate ..| No pull-up and no..| High        |.
          PB13     | CAN2_TX       | Alternate ..| No pull-up and no..| High        |.
     - Click \b OK to close the CAN2 Configuration dialog
*/

/*! \cond */


#include "CAN_STM32F4xx.h"


// Externally overridable configuration definitions

