Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/CAN_STM32F4xx.c
  return status;
}

// CAN Driver Functions

/**
  \fn          ARM_DRIVER_VERSION CAN_GetVersion (void)
  \brief       Get driver version.
  \return      ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION CAN_GetVersion (void) { return can_driver_version; }

/**
  \fn          ARM_CAN_CAPABILITIES CAN_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      ARM_CAN_CAPABILITIES
*/
static ARM_CAN_CAPABILITIES CAN_GetCapabilities (void) { return can_driver_capabilities; }

/**
  \fn          int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                        ARM_CAN_SignalObjectEvent_t cb_object_event,
                                        uint8_t                     x)
  \brief       Initialize CAN interface and register signal (callback) functions.
  \param[in]   cb_unit_event   Pointer to ARM_CAN_SignalUnitEvent callback function
  \param[in]   cb_object_event Pointer to ARM_CAN_SignalObjectEvent callback function
  \param[in]   x               Controller number (0..2)
  \return      execution status
*/
static int32_t CANx_Initialize (ARM_CAN_SignalUnitEvent_t   cb_unit_event,
                                ARM_CAN_SignalObjectEvent_t cb_object_event,
                                uint8_t                     x) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
  GPIO_InitTypeDef GPIO_InitStruct;
#endif

  if (x >= CAN_CTRL_NUM)               { return ARM_DRIVER_ERROR; }
  if (can_driver_initialized[x] != 0U) { return ARM_DRIVER_OK;    }

  CAN_SignalUnitEvent  [x] = cb_unit_event;
  CAN_SignalObjectEvent[x] = cb_object_event;

#if (MX_CAN1 == 1U)
  if (x == 0U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN1_RX_Pin)
    Enable_GPIO_Clock          (MX_CAN1_RX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN1_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN1_RX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN1_RX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN1_RX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN1_RX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN1_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN1_TX_Pin)
    Enable_GPIO_Clock          (MX_CAN1_TX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN1_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN1_TX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN1_TX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN1_TX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN1_TX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN1_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan1.Instance = CAN1;
#endif
  }
#endif
#if (MX_CAN2 == 1U)
  if (x == 1U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN2_RX_Pin)
    Enable_GPIO_Clock          (MX_CAN2_RX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN2_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN2_RX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN2_RX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN2_RX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN2_RX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN2_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN2_TX_Pin)
    Enable_GPIO_Clock          (MX_CAN2_TX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN2_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN2_TX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN2_TX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN2_TX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN2_TX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN2_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan2.Instance = CAN2;
#endif
  }
#endif
#if (MX_CAN3 == 1U)
  if (x == 2U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN3_RX_Pin)
    Enable_GPIO_Clock          (MX_CAN3_RX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN3_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN3_RX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN3_RX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN3_RX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN3_RX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN3_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN3_TX_Pin)
    Enable_GPIO_Clock          (MX_CAN3_TX_GPIOx);
    GPIO_InitStruct.Pin       = MX_CAN3_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = MX_CAN3_TX_GPIO_Mode;
    GPIO_InitStruct.Pull      = MX_CAN3_TX_GPIO_PuPd;
    GPIO_InitStruct.Speed     = MX_CAN3_TX_GPIO_Speed;
    GPIO_InitStruct.Alternate = MX_CAN3_TX_GPIO_AF;
    HAL_GPIO_Init              (MX_CAN3_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan3.Instance = CAN3;
#endif
  }
#endif

  can_driver_initialized[x] = 1U;

  return ARM_DRIVER_OK;
}
#if (MX_CAN1 == 1U)
static int32_t CAN1_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 0U); }
#endif
#if (MX_CAN2 == 1U)
static int32_t CAN2_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 1U); }
#endif
#if (MX_CAN3 == 1U)
static int32_t CAN3_Initialize (ARM_CAN_SignalUnitEvent_t cb_unit_event, ARM_CAN_SignalObjectEvent_t cb_object_event) { return CANx_Initialize (cb_unit_event, cb_object_event, 2U); }
#endif

/**
  \fn          int32_t CANx_Uninitialize (uint8_t x)
  \brief       De-initialize CAN interface.
  \param[in]   x      Controller number (0..2)
  \return      execution status
*/
static int32_t CANx_Uninitialize (uint8_t x) {
#if defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
  GPIO_InitTypeDef GPIO_InitStruct;
#endif

  if (x >= CAN_CTRL_NUM) { return ARM_DRIVER_ERROR; }

#if (MX_CAN1 == 1U)
  if (x == 0U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN1_RX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN1_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN1_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN1_TX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN1_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN1_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan1.Instance            = NULL;
#endif
  }
#endif
#if (MX_CAN2 == 1U)
  if (x == 1U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN2_RX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN2_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN2_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN2_TX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN2_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN2_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan2.Instance            = NULL;
#endif
  }
#endif
#if (MX_CAN3 == 1U)
  if (x == 2U) {
#if defined (RTE_DEVICE_FRAMEWORK_CLASSIC)
#if defined (MX_CAN3_RX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN3_RX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN3_RX_GPIOx, &GPIO_InitStruct);
#endif
#if defined (MX_CAN3_TX_Pin)
    GPIO_InitStruct.Pin       = MX_CAN3_TX_GPIO_Pin;
    GPIO_InitStruct.Mode      = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull      = GPIO_NOPULL;
    GPIO_InitStruct.Speed     = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0U;
    HAL_GPIO_Init              (MX_CAN3_TX_GPIOx, &GPIO_InitStruct);
#endif
#else
    hcan3.Instance            = NULL;
#endif
  }
#endif

  can_driver_initialized[x] = 0U;

  return ARM_DRIVER_OK;
}
#if (MX_CAN1 == 1U)
static int32_t CAN1_Uninitialize (void) { return CANx_Uninitialize (0U); }
#endif
#if (MX_CAN2 == 1U)
static int32_t CAN2_Uninitialize (void) { return CANx_Uninitialize (1U); }
#endif
#if (MX_CAN3 == 1U)
static int32_t CAN3_Uninitialize (void) { return CANx_Uninitialize (2U); }
#endif

/**
  \fn          int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x)
  \brief       Control CAN interface power.
  \param[in]   state  Power state
                 - ARM_POWER_OFF :  power off: no operation possible
                 - ARM_POWER_LOW :  low power mode: retain state, detect and signal wake-up events
                 - ARM_POWER_FULL : power on: full operation at maximum performance
  \param[in]   x      Controller number (0..2)
  \return      execution status
*/
static int32_t CANx_PowerControl (ARM_POWER_STATE state, uint8_t x) {
  CAN_TypeDef *ptr_CAN_master;
  CAN_TypeDef *ptr_CAN;
  uint32_t     msk;
  uint8_t      bank, bank_end;

  if (x >= CAN_CTRL_NUM) { return ARM_DRIVER_ERROR;           }
  if ((state != ARM_POWER_OFF)  && 
      (state != ARM_POWER_FULL) && 
      (state != ARM_POWER_LOW)) 
                         { return ARM_DRIVER_ERROR_PARAMETER; }
  if      (x == 2U)      { bank = 0U;                   bank_end = CAN3_FILTER_BANK_NUM;                        }
  else if (x == 1U)      { bank = CAN1_FILTER_BANK_NUM; bank_end = CAN1_FILTER_BANK_NUM + CAN2_FILTER_BANK_NUM; }
  else                   { bank = 0U;                   bank_end = CAN1_FILTER_BANK_NUM;                        }
  if (bank >= bank_end)  { return ARM_DRIVER_ERROR;           }

  if (x <= 1U) {
    ptr_CAN_master = ptr_CANx[0];
  } else {
    ptr_CAN_master = ptr_CANx[2];
  }
  ptr_CAN = ptr_CANx[x];

  switch (state) {
    case ARM_POWER_OFF:
      can_driver_powered[x] = 0U;
#if (MX_CAN1 == 1U)
      if (x == 0U) {
        NVIC_DisableIRQ (CAN1_TX_IRQn);
        NVIC_DisableIRQ (CAN1_RX0_IRQn);
        NVIC_DisableIRQ (CAN1_RX1_IRQn);
        NVIC_DisableIRQ (CAN1_SCE_IRQn);
      }
#endif
#if (MX_CAN2 == 1U)
      if (x == 1U) {
        NVIC_DisableIRQ (CAN2_TX_IRQn);
        NVIC_DisableIRQ (CAN2_RX0_IRQn);
        NVIC_DisableIRQ (CAN2_RX1_IRQn);
        NVIC_DisableIRQ (CAN2_SCE_IRQn);
      }
#endif
#if (MX_CAN3 == 1U)
      if (x == 2U) {
        NVIC_DisableIRQ (CAN3_TX_IRQn);
        NVIC_DisableIRQ (CAN3_RX0_IRQn);
        NVIC_DisableIRQ (CAN3_RX1_IRQn);
        NVIC_DisableIRQ (CAN3_SCE_IRQn);
      }
#endif

