Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/CAN_STM32F4xx.c
  if (CAN_SignalUnitEvent[1] != NULL) {
    esr = CAN2->ESR;
    ier = CAN2->IER;
    CAN2->MSR = CAN_MSR_ERRI;             // Clear error interrupt
    if      (((esr & CAN_ESR_BOFF) != 0U) && ((ier & CAN_IER_BOFIE) != 0U)) { CAN2->IER &= ~CAN_IER_BOFIE; CAN_SignalUnitEvent[1](ARM_CAN_EVENT_UNIT_BUS_OFF); }
    else if (((esr & CAN_ESR_EPVF) != 0U) && ((ier & CAN_IER_EPVIE) != 0U)) { CAN2->IER &= ~CAN_IER_EPVIE; CAN_SignalUnitEvent[1](ARM_CAN_EVENT_UNIT_PASSIVE); }
    else if (((esr & CAN_ESR_EWGF) != 0U) && ((ier & CAN_IER_EWGIE) != 0U)) { CAN2->IER &= ~CAN_IER_EWGIE; CAN_SignalUnitEvent[1](ARM_CAN_EVENT_UNIT_WARNING); }
  }
}
#endif

#if (MX_CAN3 == 1U)
/**
  \fn          void CAN3_TX_IRQHandler (void)
  \brief       CAN3 Transmit Interrupt Routine (IRQ).
*/
void CAN3_TX_IRQHandler (void) {
  uint32_t esr, ier;

  if ((CAN3->TSR & CAN_TSR_RQCP0) != 0U) {
    if ((CAN3->TSR & CAN_TSR_TXOK0) != 0U) {
      if (can_obj_cfg[2][CAN_RX_OBJ_NUM] == ARM_CAN_OBJ_TX) {
        if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](CAN_RX_OBJ_NUM, ARM_CAN_EVENT_SEND_COMPLETE); }
      }
    }
    CAN3->TSR = CAN_TSR_RQCP0;          // Request completed on transmit mailbox 0
  }
  if ((CAN3->TSR & CAN_TSR_RQCP1) != 0U) {
    if ((CAN3->TSR & CAN_TSR_TXOK1) != 0U) {
      if (can_obj_cfg[2][CAN_RX_OBJ_NUM+1U] == ARM_CAN_OBJ_TX) {
        if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](CAN_RX_OBJ_NUM+1U, ARM_CAN_EVENT_SEND_COMPLETE); }
      }
    }
    CAN3->TSR = CAN_TSR_RQCP1;          // Request completed on transmit mailbox 1
  }
  if ((CAN3->TSR & CAN_TSR_RQCP2) != 0U) {
    if ((CAN3->TSR & CAN_TSR_TXOK2) != 0U) {
      if (can_obj_cfg[2][CAN_RX_OBJ_NUM+2U] == ARM_CAN_OBJ_TX) {
        if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](CAN_RX_OBJ_NUM+2U, ARM_CAN_EVENT_SEND_COMPLETE); }
      }
    }
    CAN3->TSR = CAN_TSR_RQCP2;          // Request completed on transmit mailbox 2
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN3->ESR;
  ier = CAN3->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN3->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN3->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) == 95U) && (((esr & CAN_ESR_REC) >> 24) < 95U)) {
    CAN3->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN3_RX0_IRQHandler (void)
  \brief       CAN3 Receive on FIFO0 Interrupt Routine (IRQ).
*/
void CAN3_RX0_IRQHandler (void) {
  uint32_t esr, ier;

  if (can_obj_cfg[2][0] == ARM_CAN_OBJ_RX) {
    if ((CAN3->RF0R & CAN_RF0R_FOVR0) != 0U) {
      CAN3->RF0R = CAN_RF0R_FOVR0;      // Clear overrun flag
      if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](0U, ARM_CAN_EVENT_RECEIVE | ARM_CAN_EVENT_RECEIVE_OVERRUN); }
    } else if ((CAN3->RF0R & CAN_RF0R_FMP0) != 0U) {
      if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](0U, ARM_CAN_EVENT_RECEIVE); }
    }
  } else {
    CAN3->RF0R = CAN_RF0R_RFOM0;        // Release FIFO 0 output mailbox if object not enabled for reception
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN3->ESR;
  ier = CAN3->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN3->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN3->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) < 95U) && (((esr & CAN_ESR_REC) >> 24) == 95U)) {
    CAN3->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN3_RX1_IRQHandler (void)
  \brief       CAN3 Receive on FIFO1 Interrupt Routine (IRQ).
*/
void CAN3_RX1_IRQHandler (void) {
  uint32_t esr, ier;

  if (can_obj_cfg[2][1] == ARM_CAN_OBJ_RX) {
    if ((CAN3->RF1R & CAN_RF1R_FOVR1) != 0U) {
      CAN3->RF1R = CAN_RF1R_FOVR1;      // Clear overrun flag
      if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](1U, ARM_CAN_EVENT_RECEIVE | ARM_CAN_EVENT_RECEIVE_OVERRUN); }
    } else if ((CAN3->RF1R & CAN_RF1R_FMP1) != 0U) {
      if (CAN_SignalObjectEvent[2] != NULL) { CAN_SignalObjectEvent[2](1U, ARM_CAN_EVENT_RECEIVE); }
    }
  } else {
    CAN3->RF1R = CAN_RF1R_RFOM1;        // Release FIFO 1 output mailbox if object not enabled for reception
  }

  // Handle transition from from 'bus off', ' error active' state, or re-enable warning interrupt
  esr = CAN3->ESR;
  ier = CAN3->IER;
  if (((esr & CAN_ESR_BOFF) == 0U) && ((ier & CAN_IER_BOFIE) == 0U)) { 
    CAN3->IER |= CAN_IER_BOFIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_PASSIVE); }
  }
  if (((esr & CAN_ESR_EPVF) == 0U) && ((ier & CAN_IER_EPVIE) == 0U)) {
    CAN3->IER |= CAN_IER_EPVIE;
    if (CAN_SignalUnitEvent[2] != NULL) { CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_ACTIVE); }
  }
  if (((esr & CAN_ESR_EWGF) == 0U) && ((ier & CAN_IER_EWGIE) == 0U) && (((esr & CAN_ESR_TEC) >> 16) < 95U) && (((esr & CAN_ESR_REC) >> 24) == 95U)) {
    CAN3->IER |= CAN_IER_EWGIE;
  }
}

/**
  \fn          void CAN3_SCE_IRQHandler (void)
  \brief       CAN3 Error and Status Change Interrupt Routine (IRQ).
*/
void CAN3_SCE_IRQHandler (void) {
  uint32_t esr, ier;

  if (CAN_SignalUnitEvent[2] != NULL) {
    esr = CAN3->ESR;
    ier = CAN3->IER;
    CAN3->MSR = CAN_MSR_ERRI;             // Clear error interrupt
    if      (((esr & CAN_ESR_BOFF) != 0U) && ((ier & CAN_IER_BOFIE) != 0U)) { CAN3->IER &= ~CAN_IER_BOFIE; CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_BUS_OFF); }
    else if (((esr & CAN_ESR_EPVF) != 0U) && ((ier & CAN_IER_EPVIE) != 0U)) { CAN3->IER &= ~CAN_IER_EPVIE; CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_PASSIVE); }
    else if (((esr & CAN_ESR_EWGF) != 0U) && ((ier & CAN_IER_EWGIE) != 0U)) { CAN3->IER &= ~CAN_IER_EWGIE; CAN_SignalUnitEvent[2](ARM_CAN_EVENT_UNIT_WARNING); }
  }
}
#endif


#if (MX_CAN1 == 1U)
ARM_DRIVER_CAN Driver_CAN1 = {
  CAN_GetVersion,
  CAN_GetCapabilities,
  CAN1_Initialize,
  CAN1_Uninitialize,
  CAN1_PowerControl,
  CAN_GetClock,
  CAN1_SetBitrate,
  CAN1_SetMode,
  CAN1_ObjectGetCapabilities,
  CAN1_ObjectSetFilter,
  CAN1_ObjectConfigure,
  CAN1_MessageSend,
  CAN1_MessageRead,
  CAN1_Control,
  CAN1_GetStatus
};
#endif

#if (MX_CAN2 == 1U)
ARM_DRIVER_CAN Driver_CAN2 = {
  CAN_GetVersion,
  CAN_GetCapabilities,
  CAN2_Initialize,
  CAN2_Uninitialize,
  CAN2_PowerControl,
  CAN_GetClock,
  CAN2_SetBitrate,
  CAN2_SetMode,
  CAN2_ObjectGetCapabilities,
  CAN2_ObjectSetFilter,
  CAN2_ObjectConfigure,
  CAN2_MessageSend,
  CAN2_MessageRead,
  CAN2_Control,
  CAN2_GetStatus
};
#endif

#if (MX_CAN3 == 1U)
ARM_DRIVER_CAN Driver_CAN3 = {
  CAN_GetVersion,
  CAN_GetCapabilities,
  CAN3_Initialize,
  CAN3_Uninitialize,
  CAN3_PowerControl,
  CAN_GetClock,
  CAN3_SetBitrate,
  CAN3_SetMode,
  CAN3_ObjectGetCapabilities,
  CAN3_ObjectSetFilter,
  CAN3_ObjectConfigure,
  CAN3_MessageSend,
  CAN3_MessageRead,
  CAN3_Control,
  CAN3_GetStatus
};
#endif

/*! \endcond */
